cases/QuiescentFlow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    air_left
    {
        type            advective;
    }
    air_up
    {
        type            advective;
    }
    air_right
    {
        type            advective;
    }
    solid_left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    solid_bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    solid_right
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    actuator1_surface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    actuator2_surface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    zfaces
    {
        type            empty;
    }
}


// ************************************************************************* //
