cases/QuiescentFlow/0/air/rhoc
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      rhoc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 -3 1 0 0 1 0 ];

internalField   uniform 0;

boundaryField
{
    air_left
    {
        type            zeroGradient;
        value           uniform 0;
    }
    air_up
    {
        type            zeroGradient;
        value           uniform 0;
    }
    air_right
    {
        type            zeroGradient;
        value           uniform 0;
    }
    actuator1_surface
    {
        type            zeroGradient;
        value           0;
    }
    zfaces
    {
        type            empty;
    }
    air_to_solid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 0;
        Tnbr            rhoc;
        kappa           lookup;
        kappaName       epsField;
    }
}


// ************************************************************************* //
