cases/QuiescentFlow/constant/air/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// kinematic viscosity of air
nu          [0 2 -1 0 0 0 0]    1.568E-5;

// relative permitivity
eps         [0 0 0 0 0 0 0]     1;

// Debye length
lambda      [0 1 0 0 0 0 0]     1.7E-4;

// ************************************************************************* //
