cases/QuiescentFlow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    air_left
    {
        type            patch;
        nFaces          236;
        startFace       1228749;
    }
    air_up
    {
        type            patch;
        nFaces          1720;
        startFace       1228985;
    }
    air_right
    {
        type            patch;
        nFaces          236;
        startFace       1230705;
    }
    solid_left
    {
        type            patch;
        nFaces          125;
        startFace       1230941;
    }
    solid_bottom
    {
        type            patch;
        nFaces          1720;
        startFace       1231066;
    }
    solid_right
    {
        type            patch;
        nFaces          125;
        startFace       1232786;
    }
    actuator1_surface
    {
        type            patch;
        nFaces          1010;
        startFace       1232911;
    }
    actuator2_surface
    {
        type            patch;
        nFaces          1010;
        startFace       1233921;
    }
    zfaces
    {
        type            empty;
        nFaces          1231840;
        startFace       1234931;
    }
)

// ************************************************************************* //
