cases/QuiescentFlow/system/air/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    ep
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
        maxIter         10;
    }

    rhoc
    {
        solver          smoothSolver;
        smoother        DICGaussSeidel;
        tolerance       1e-08;
        relTol          0;
        maxIter         1;
    }
    
    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0;
        maxIter         5000;
    }

    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0;
        maxIter         5000;
        smoother        GaussSeidel;
        nPreSweeps      1;
        nPostSweeps     1;
        nFinestSweeps   2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
    }
}

PISO
{
    nCorrector  2;
    nNonOrthogonalCorrectors 1;
    pRefCell    0;
    pRefValue   0;
}

// ************************************************************************* //
